In [4]:
import pandas as pd

names = pd.read_csv("baby_names_France.tsv",sep="\t")
names

        sexe preusuel annais  nombre
0          1        A   1980       3
1          1        A   1998       3
2          1        A   XXXX      22
3          1    AADAM   2009       4
4          1    AADAM   2014       3
...      ...      ...    ...     ...
620988     2    ÖZLEM   2013       3
620989     2    ÖZLEM   2014       5
620990     2    ÖZLEM   2015       3
620991     2    ÖZLEM   2016       3
620992     2    ÖZLEM   XXXX      25

[620993 rows x 4 columns]

In [13]:
names.index

RangeIndex(start=0, stop=620993, step=1)

In [12]:
names.columns

Index(['sexe', 'preusuel', 'annais', 'nombre'], dtype='object')

In [11]:
names.values

array([[1, 'A', '1980', 3],
       [1, 'A', '1998', 3],
       [1, 'A', 'XXXX', 22],
       ...,
       [2, 'ÖZLEM', '2015', 3],
       [2, 'ÖZLEM', '2016', 3],
       [2, 'ÖZLEM', 'XXXX', 25]], dtype=object)

In [10]:
names.dtypes

sexe         int64
preusuel    object
annais      object
nombre       int64
dtype: object

In [14]:
names.empty

False

In [9]:
names.head()

   sexe preusuel annais  nombre
0     1        A   1980       3
1     1        A   1998       3
2     1        A   XXXX      22
3     1    AADAM   2009       4
4     1    AADAM   2014       3

In [8]:
names.tail()

        sexe preusuel annais  nombre
620988     2    ÖZLEM   2013       3
620989     2    ÖZLEM   2014       5
620990     2    ÖZLEM   2015       3
620991     2    ÖZLEM   2016       3
620992     2    ÖZLEM   XXXX      25

In [7]:
names.shape

(620993, 4)

In [6]:
names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 620993 entries, 0 to 620992
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   sexe      620993 non-null  int64
 1   preusuel  620990 non-null  object
 2   annais    620993 non-null  object
 3   nombre    620993 non-null  int64
dtypes: int64(2), object(2)
memory usage: 19.0+ MB

In [20]:
xxx = names.loc[names['annais'] == "XXXX"].reset_index(inplace=False, drop=True)
xxx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34166 entries, 0 to 34165
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sexe      34166 non-null  int64
 1   preusuel  34165 non-null  object
 2   annais    34166 non-null  object
 3   nombre    34166 non-null  int64
dtypes: int64(2), object(2)
memory usage: 1.0+ MB